part of 'instagram_post_data.dart';

const String _post01 =
    'Летом мы неистово готовились к главной IT-тусовке этой осени (угадайте какой), '
    'погуляли на шикарной свадьбе наших друллег, сходили в поход вдоль берега Жигулевского моря и позвали в'
    'гости меркурианцев из других городов.\n'
    '\n'
    'Фух, на одном дыхании! Теперь ваша очередь. Как прошло лето?\n'
    '\n'
    '#mercdev';

const String _post02 =
    'Сняли ролик, в котором главный по фронтенду задаёт острые вопросы главному по дизайну в Меркури.\n'
    '\n'
    'Немного не спойлеров, о чем там речь \u{1F447}\n'
    '\n'
    '\u{1F308} Почему надо всегда делать дизайн-систему, но на практике получается не всегда.\n'
    '\n'
    '\u{1F308} Зачем продумывать дизайн наперед и что будет, если этого не делать.\n'
    '\n'
    '\u{1F308} Как дизайнеру доносить идеи для разработчика, а разработчику их понимать.\n'
    '\n'
    '\u{1F308} Почему инклюзивный интерфейс это важно, но делать его мы, конечно же, не будем.\n'
    '\n'
    '\u{1F308} Как дизайнеры аргументируют свои решения, почему это не устраивает разработчиков и как нам всем с этим жить.\n'
    '\n'
    '\u{1F308} Неочевидные закономерности в дизайне, которые помогут разработчикам понять, что баг, что фича.\n'
    '\n'
    '\u{26A1} В конце поспорили о дизайне одного из наших проектов. Угадайте, кто выиграл?\n'
    '\n'
    'Ролик на ютубе, а ссылку на ютуб всегда можно найти у нас в профиле. Приходите смотреть.\n'
    '\n'
    '#mercdev';

const String _post03 =
    'Этот декларативный UI-фреймворк сильно упрощает разработку интефейса на Android - кода меньше, шанс допустить ошибку ниже,'
    'простая миграция и удобная интаграция с основными библиотеками Kotlin.\n'
    '\n'
    'В общем, смотрите карусель \u{1F449}\n'
    '\n'
    '#mercdev';
