part of 'instagram_post_data.dart';

const String _post01 = '''
Летом мы неистово готовились к главной IT-тусовке этой осени (угадайте какой), погуляли на шикарной свадьбе наших друллег, сходили в поход вдоль берега Жигулевского моря и позвали в гости меркурианцев из других городов.

Фух, на одном дыхании! Теперь ваша очередь. Как прошло лето?

#mercdev
''';

const String _post02 = '''
Сняли ролик, в котором главный по фронтенду задаёт острые вопросы главному по дизайну в Меркури.

Немного не спойлеров, о чем там речь \u{1F447}

\u{1F308} Почему надо всегда делать дизайн-систему, но на практике получается не всегда.

\u{1F308} Зачем продумывать дизайн наперед и что будет, если этого не делать.

\u{1F308} Как дизайнеру доносить идеи для разработчика, а разработчику их понимать.

\u{1F308} Почему инклюзивный интерфейс это важно, но делать его мы, конечно же, не будем.

\u{1F308} Как дизайнеры аргументируют свои решения, почему это не устраивает разработчиков и как нам всем с этим жить.

\u{1F308} Неочевидные закономерности в дизайне, которые помогут разработчикам понять, что баг, что фича.

\u{26A1} В конце поспорили о дизайне одного из наших проектов. Угадайте, кто выиграл?

Ролик на ютубе, а ссылку на ютуб всегда можно найти у нас в профиле. Приходите смотреть.

#mercdev
''';

const String _post03 = '''
Этот декларативный UI-фреймворк сильно упрощает разработку интефейса на Android - кода меньше, шанс допустить ошибку ниже, простая миграция и удобная интаграция с основными библиотеками Kotlin.

В общем, смотрите карусель \u{1F449}

#mercdev
''';

const String _post04 = '''
@festvolgafest - мультиформатный опен-эйр на набережной с арт-объектами, инди-музыкой, лекторием и свежим волжским вайбом.
Сделали для участников фестиваля крутое приложение. Там можно:

− собрать собственное расписание, чтобы не пропустить интересную лекцию, мастер-класс или выступление;
− всегда держать под рукой карту фестиваля;
− задать вопрос лектору и общаться в общем чате с другими участниками и организаторами.

Приложение уже можно найти в App Store и Google Play по слову «ВолгаФест»

Еще ребята из Меркури примут участие в лектории о дизайне и технологиях @404fest - скоро в соцсетях «Фестиваля 404» появятся подробности.

Если вы из Самары и окрестностей, приходите тусить с нами на ВолгаФесте, будет классно \u{1F30A}\u{1F30A}\u{1F30A}

#mercdev
''';

const String _post05 = '''
Иконки из подборки можно использовать в коммерческих целях \u{1F60E}

#mercdev
''';

const String _post06 = '''
Не так часто разработчики используют утилиты Instruments, а напрасно - они помогают в работе и порой сильно упрощают нам жизнь.

В карточках собрали мастхэв инструменты и описали сценарии их использования.

#mercdev
''';

const String _post07 = '''
Наш фронтенд-тур получил второе дыхание, и в ближайшие месяцы проведем еще несколько митапов в разных городах России!\u{1F525}

Обязательно приходите, если нашли свой город в списке - запись по ссылке в профиле.

\u{26A1} Серия митапов Mercury PRO — это лекции и воркшопы для профессионалов. Поговорим, как развиваться фронтендеру, поделимся своим опытом использования полезных фронтенд-инструментов.

\u{1F4CB} Программа:

− Мобилизация фронтенда — доклад про любовь фронтендера к мобильной разработке.
Алексей Кузнецов поделится опытом работы с React Native и расскажет, почему это важный и нужный инструмент, с которым стоит наладить отношения.

− Как я за день стал Node.js разработчиком.
Сергей Бутузов расскажет, как фронтендеру научиться создавать расширяемые и долгоиграющие проекты на Node.js, а не временные решения, которые потом перепишут с нуля.

− Developer Experience (DX): Разработчики — тоже люди. GraphQL
Алексей Родионов о GraphQL — самой революционной технологии извлечения данных со времен AJAX.
Расскажет, какие проблемы решает GraphQL и поделится опытом интеграции и эксплуатации технологии на крупном проекте.

А в завершение митапов играем в Свою Игру! \u{1F9D0}
Победители получают в награду новенькие AirPods Pro.

Участие бесплатное, записаться можно на сайте Mercury Pro — легко найти через мультиссылку в профиле.

#mercdev
''';

const String _post08 = '''
Владимир Сурдин - астроном, член Международного астрономического союза и популяризатор науки приедет в Меркури рассказывать о космосе. Как вам такие новости в День космонавтики?

В художественных и научно-популярных фильмах, в статьях и в книгах мы часто видим загадочные изображения космических объектов и явлений. Но правда в том, что не всегда стоит им верить. Владимир Георгиевич расскажет, как отделить факты от фантазии.

Всех ждем 12 мая в 19:00 в самарском офисе. Лекция открытая, но количество свободных мест ограничено — их всего 25.
Чтобы получить приглашение, нужно быть подписанным на наш инстаграм, сделать репост этой записи с отметкой @mercdev.
Первым репостнувшим вышлем ссылку на регистрацию. Всем space! \u{1F30C}

#mercdev
''';

const String _post09 = '''
Подсмотрели за нашими аналитиками и собрали в карточках всю информацию о том, чем занимаются BA в Меркури. Заодно узнали какие скиллы помогут попасть в их ряды.

Спойлер: это правильный путь, если вы никогда не работали в IT, но очень хотите.

#mercdev
''';

const String _post10 = '''
Мы запускаем React Bootcamp!

Это интенсив от ведущих фронтенд-разработчиков Меркури. Он рассчитан на тех, кто уже уверенно верстает и пишет приложения на любом фреймворке или чистом JS и хочет стать по-настоящему крутым фронтендером.

\u{1F4A1} Темы:
− глубокое погружение в React;
− TypeScript;
− Gitlab CI/CD
− React Native;
− Next.js и многое другое.

Буткемп пройдет в 2 этапа. Сначала — онлайн-митапы и воркшопы с проверкой заданий. Затем закрепляем знания на практике: лучших стажеров собираем в проектные команды и создаем приложения с нуля.

Старт — 24 мая в онлайне, поэтому участвовать можно из любого уголка России. Самым успешным участникам платим стипендию, а лучших приглашаем на работу в Меркури.

Подать заявку и узнать больше подробностей можно по ссылке в профиле.

#mercdev  
''';

const String _post11 = '''
У меркурианцев в самарской штаб-квартире обнаружилась острая уютонедостаточность. Ищем котика, который возьмет на себя заботу об офисе и его жителях. Самые важные качества, наобходимые для этой работы, смотрите в карусели \u{1F449}

Если вы такого знаете - обязательно отправьте ему этот пост.

#mercdev
''';

const String _post12 = '''
Послушали лекцию по астрономии, и самые главные мысли записали на слайдах \u{1F30C}

Если кратко: мы в астрономическом восторге! На лекции узнали всю правду об американцах на Луне, как художники рисуют экзопланеты, какой из голливудских фильмов про космос самый правдоподобный и как Илон Маск мешает астрономам смотреть в звездное небо.

Если вам тоже все это интересно, приходите к нам на ютуб смотреть запись лекции. 
Канал Меркури можно найти по мультиссылке в профиле.

#mercdev
''';
